index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-17 Wed 10:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Alacritty configuration</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Alacritty configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd6aff7e">alacritty.toml</a>
<ul>
<li><a href="#org002da6b">general</a></li>
<li><a href="#org4f89d53">window</a>
<ul>
<li><a href="#org33af8d0">dynamic padding</a></li>
<li><a href="#org2d1e346">decoration</a></li>
<li><a href="#orgcd61403">padding</a></li>
<li><a href="#org9cc1e90">blur</a></li>
<li><a href="#org0bdd2b9">decorator theme variant</a></li>
</ul>
</li>
<li><a href="#org80377f8">scrolling</a>
<ul>
<li><a href="#org44223b9">history</a></li>
<li><a href="#org2e8d78f">multiplier</a></li>
</ul>
</li>
<li><a href="#orgb6e9611">Font</a>
<ul>
<li><a href="#org91cea8a">normal</a></li>
<li><a href="#org83ac83b">bold</a></li>
<li><a href="#org417759b">italic</a></li>
<li><a href="#orgd2d21e3">bold_italic</a></li>
<li><a href="#org91e9db5">size</a></li>
</ul>
</li>
<li><a href="#org9b09bc4">bell</a>
<ul>
<li><a href="#org9186c54">animation</a></li>
<li><a href="#org81aaf49">duration</a></li>
</ul>
</li>
<li><a href="#orgf24c326">cursor</a>
<ul>
<li><a href="#org746e8a4">style</a></li>
<li><a href="#orgc9867d9">vi mode style</a></li>
</ul>
</li>
<li><a href="#orga8de443">mouse</a>
<ul>
<li><a href="#org871b03b">hide when typing</a></li>
</ul>
</li>
<li><a href="#org1b767e1">selection</a>
<ul>
<li><a href="#orgf642715">save to clipboard</a></li>
</ul>
</li>
<li><a href="#orga2c27c8">env</a>
<ul>
<li><a href="#org9d31dca">term</a></li>
</ul>
</li>
<li><a href="#orgf7d68db">hints</a>
<ul>
<li><a href="#org0468321">enabled</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc99ad78">Themes</a>
<ul>
<li><a href="#orgb0f087e">nord</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd6aff7e" class="outline-2">
<h2 id="orgd6aff7e">alacritty.toml</h2>
<div class="outline-text-2" id="text-orgd6aff7e">
<p>
See all the syntax and available variables in their <a href="https://alacritty.org/config-alacritty.html">official site</a>.
</p>
</div>
<div id="outline-container-org002da6b" class="outline-3">
<h3 id="org002da6b">general</h3>
<div class="outline-text-3" id="text-org002da6b">
<p>
The general sections.
</p>
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">general</span>]
</pre>
</div>
<p>
Include the theme files.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">import</span> = [<span style="color: #bc8f8f;">"~/.config/alacritty/themes/nord.toml"</span>]
</pre>
</div>
<p>
This enables live configuration reloading
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">live_config_reload</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f89d53" class="outline-3">
<h3 id="org4f89d53">window</h3>
<div class="outline-text-3" id="text-org4f89d53">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">window</span>]
</pre>
</div>
</div>
<div id="outline-container-org33af8d0" class="outline-4">
<h4 id="org33af8d0">dynamic padding</h4>
<div class="outline-text-4" id="text-org33af8d0">
<p>
Spread additional padding evenly around the terminal content.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">dynamic_padding</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d1e346" class="outline-4">
<h4 id="org2d1e346">decoration</h4>
<div class="outline-text-4" id="text-org2d1e346">
<p>
Window decorations.
</p>
<dl class="org-dl">
<dt>Full</dt><dd>Borders and title bar.</dd>
<dt>None</dt><dd>Neither borders nor title bar.</dd>
<dt>Transparent (macOS only)</dt><dd>Title bar, transparent background and title bar buttons.</dd>
<dt>Buttonless (macOS only)</dt><dd>Title bar, transparent background and no title bar buttons.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">decorations</span> = <span style="color: #bc8f8f;">"None"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd61403" class="outline-4">
<h4 id="orgcd61403">padding</h4>
<div class="outline-text-4" id="text-orgcd61403">
<p>
Blank space added around the window in pixels. This padding is scaled by DPI and the specified value is always added at both opposing sides.
</p>

<p>
Default: <code>{ x = 0, y = 0 }</code>
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">padding</span> = { x = 25, y = 25 }
</pre>
</div>
</div>
</div>
<div id="outline-container-org9cc1e90" class="outline-4">
<h4 id="org9cc1e90">blur</h4>
<div class="outline-text-4" id="text-org9cc1e90">
<p>
Request compositor to blur content behind transparent windows.
</p>

<p>
Default: <code>false</code>
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">blur</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0bdd2b9" class="outline-4">
<h4 id="org0bdd2b9">decorator theme variant</h4>
<div class="outline-text-4" id="text-org0bdd2b9">
<p>
Override the variant of the System theme/GTK theme/Wayland client side decorations. Set this to "None" to use the system's default theme variant.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">decorations_theme_variant</span> = <span style="color: #bc8f8f;">"Dark"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org80377f8" class="outline-3">
<h3 id="org80377f8">scrolling</h3>
<div class="outline-text-3" id="text-org80377f8">
</div>
<div id="outline-container-org44223b9" class="outline-4">
<h4 id="org44223b9">history</h4>
<div class="outline-text-4" id="text-org44223b9">
<p>
Maximum number of lines in the scrollback buffer. Specifying 0 will disable scrolling. Limited to 100000.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">history</span> = 100000
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e8d78f" class="outline-4">
<h4 id="org2e8d78f">multiplier</h4>
<div class="outline-text-4" id="text-org2e8d78f">
<p>
Number of line scrolled for every input scroll increment.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">multiplier</span> = 2
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb6e9611" class="outline-3">
<h3 id="orgb6e9611">Font</h3>
<div class="outline-text-3" id="text-orgb6e9611">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">font</span>]
</pre>
</div>
</div>
<div id="outline-container-org91cea8a" class="outline-4">
<h4 id="org91cea8a">normal</h4>
<div class="outline-text-4" id="text-org91cea8a">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">normal</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Regular"</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org83ac83b" class="outline-4">
<h4 id="org83ac83b">bold</h4>
<div class="outline-text-4" id="text-org83ac83b">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">bold</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Bold"</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org417759b" class="outline-4">
<h4 id="org417759b">italic</h4>
<div class="outline-text-4" id="text-org417759b">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">italic</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Italic"</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd2d21e3" class="outline-4">
<h4 id="orgd2d21e3">bold_italic</h4>
<div class="outline-text-4" id="text-orgd2d21e3">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">bold_italic</span> = { family = <span style="color: #bc8f8f;">"JetBrainsMonoNL Nerd Font Mono"</span>, style = <span style="color: #bc8f8f;">"Semibold Italic"</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org91e9db5" class="outline-4">
<h4 id="org91e9db5">size</h4>
<div class="outline-text-4" id="text-org91e9db5">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">size</span> = 8
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9b09bc4" class="outline-3">
<h3 id="org9b09bc4">bell</h3>
<div class="outline-text-3" id="text-org9b09bc4">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">bell</span>]
</pre>
</div>
</div>
<div id="outline-container-org9186c54" class="outline-4">
<h4 id="org9186c54">animation</h4>
<div class="outline-text-4" id="text-org9186c54">
<p>
Visual bell animation effect for flashing the screen when the visual bell is rung.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">animation</span> = <span style="color: #bc8f8f;">"EaseOutCirc"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org81aaf49" class="outline-4">
<h4 id="org81aaf49">duration</h4>
<div class="outline-text-4" id="text-org81aaf49">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">duration</span> = 1
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf24c326" class="outline-3">
<h3 id="orgf24c326">cursor</h3>
<div class="outline-text-3" id="text-orgf24c326">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">cursor</span>]
</pre>
</div>
</div>
<div id="outline-container-org746e8a4" class="outline-4">
<h4 id="org746e8a4">style</h4>
<div class="outline-text-4" id="text-org746e8a4">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">style</span> = { shape = <span style="color: #bc8f8f;">"Beam"</span>, blinking = <span style="color: #bc8f8f;">"On"</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9867d9" class="outline-4">
<h4 id="orgc9867d9">vi mode style</h4>
<div class="outline-text-4" id="text-orgc9867d9">
<p>
If the vi mode cursor style is "None" or not specified, it will fall back to the active value of the normal cursor.
</p>
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">vi_mode_style</span> = { shape = <span style="color: #bc8f8f;">"Block"</span>, blinking = <span style="color: #bc8f8f;">"Off"</span> }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga8de443" class="outline-3">
<h3 id="orga8de443">mouse</h3>
<div class="outline-text-3" id="text-orga8de443">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">mouse</span>]
</pre>
</div>
</div>
<div id="outline-container-org871b03b" class="outline-4">
<h4 id="org871b03b">hide when typing</h4>
<div class="outline-text-4" id="text-org871b03b">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">hide_when_typing</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1b767e1" class="outline-3">
<h3 id="org1b767e1">selection</h3>
<div class="outline-text-3" id="text-org1b767e1">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">selection</span>]
</pre>
</div>
</div>
<div id="outline-container-orgf642715" class="outline-4">
<h4 id="orgf642715">save to clipboard</h4>
<div class="outline-text-4" id="text-orgf642715">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">save_to_clipboard</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga2c27c8" class="outline-3">
<h3 id="orga2c27c8">env</h3>
<div class="outline-text-3" id="text-orga2c27c8">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">env</span>]
</pre>
</div>
</div>
<div id="outline-container-org9d31dca" class="outline-4">
<h4 id="org9d31dca">term</h4>
<div class="outline-text-4" id="text-org9d31dca">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">TERM</span> = <span style="color: #bc8f8f;">"xterm-256color"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf7d68db" class="outline-3">
<h3 id="orgf7d68db">hints</h3>
<div class="outline-text-3" id="text-orgf7d68db">
</div>
<div id="outline-container-org0468321" class="outline-4">
<h4 id="org0468321">enabled</h4>
<div class="outline-text-4" id="text-org0468321">
<div class="org-src-container">
<pre class="src src-toml">[[<span style="color: #228b22;">hints.enabled</span>]]
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org94cef64"></a>command<br />
<div class="outline-text-5" id="text-org94cef64">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">command</span> = <span style="color: #bc8f8f;">"xdg-open"</span>
</pre>
</div>
</div>
</li>
<li><a id="org554734f"></a>hyperlinks<br />
<div class="outline-text-5" id="text-org554734f">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">hyperlinks</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</li>
<li><a id="orgb2686ad"></a>post processing<br />
<div class="outline-text-5" id="text-orgb2686ad">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">post_processing</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</li>
<li><a id="orgdd71a66"></a>persist<br />
<div class="outline-text-5" id="text-orgdd71a66">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">persist</span> = <span style="color: #4169e1;">false</span>
</pre>
</div>
</div>
</li>
<li><a id="orga1cb1ef"></a>mouse<br />
<div class="outline-text-5" id="text-orga1cb1ef">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">mouse.enabled</span> = <span style="color: #4169e1;">true</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf4929ba"></a>binding<br />
<div class="outline-text-5" id="text-orgf4929ba">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">binding</span> = { key = <span style="color: #bc8f8f;">"U"</span>, mods = <span style="color: #bc8f8f;">"Control|Shift"</span> }
</pre>
</div>
</div>
</li>
<li><a id="orgfd735f4"></a>regex<br />
<div class="outline-text-5" id="text-orgfd735f4">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b8860b;">regex</span> = <span style="color: #bc8f8f;">"(ipfs:|ipns:|magnet:|mailto:|gemini://|gopher://|https://|http://|news:|file:|git://|ssh:|ftp://)[^\u0000-\u001F\u007F-\u009F&lt;&gt;\"\\s{-}\\^&#10216;&#10217;`]+"</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc99ad78" class="outline-2">
<h2 id="orgc99ad78">Themes</h2>
<div class="outline-text-2" id="text-orgc99ad78">
</div>
<div id="outline-container-orgb0f087e" class="outline-3">
<h3 id="orgb0f087e">nord</h3>
<div class="outline-text-3" id="text-orgb0f087e">
<div class="org-src-container">
<pre class="src src-toml"><span style="color: #b22222;"># </span><span style="color: #b22222;">-*- eval: (rainbow-mode 1) -*-
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Colors (Nord)
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Default colors
</span>[<span style="color: #228b22;">colors.primary</span>]
<span style="color: #b8860b;">background</span> = <span style="color: #bc8f8f;">'#2E3440'</span>
<span style="color: #b8860b;">foreground</span> = <span style="color: #bc8f8f;">'#D8DEE9'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Normal colors
</span>[<span style="color: #228b22;">colors.normal</span>]
<span style="color: #b8860b;">black</span>   = <span style="color: #bc8f8f;">'#3B4252'</span>
<span style="color: #b8860b;">red</span>     = <span style="color: #bc8f8f;">'#BF616A'</span>
<span style="color: #b8860b;">green</span>   = <span style="color: #bc8f8f;">'#A3BE8C'</span>
<span style="color: #b8860b;">yellow</span>  = <span style="color: #bc8f8f;">'#EBCB8B'</span>
<span style="color: #b8860b;">blue</span>    = <span style="color: #bc8f8f;">'#81A1C1'</span>
<span style="color: #b8860b;">magenta</span> = <span style="color: #bc8f8f;">'#B48EAD'</span>
<span style="color: #b8860b;">cyan</span>    = <span style="color: #bc8f8f;">'#88C0D0'</span>
<span style="color: #b8860b;">white</span>   = <span style="color: #bc8f8f;">'#E5E9F0'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Bright colors
</span>[<span style="color: #228b22;">colors.bright</span>]
<span style="color: #b8860b;">black</span>   = <span style="color: #bc8f8f;">'#4C566A'</span>
<span style="color: #b8860b;">red</span>     = <span style="color: #bc8f8f;">'#BF616A'</span>
<span style="color: #b8860b;">green</span>   = <span style="color: #bc8f8f;">'#A3BE8C'</span>
<span style="color: #b8860b;">yellow</span>  = <span style="color: #bc8f8f;">'#EBCB8B'</span>
<span style="color: #b8860b;">blue</span>    = <span style="color: #bc8f8f;">'#81A1C1'</span>
<span style="color: #b8860b;">magenta</span> = <span style="color: #bc8f8f;">'#B48EAD'</span>
<span style="color: #b8860b;">cyan</span>    = <span style="color: #bc8f8f;">'#8FBCBB'</span>
<span style="color: #b8860b;">white</span>   = <span style="color: #bc8f8f;">'#ECEFF4'</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-17 Wed 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-09-17 Wed 10:28</p>
</div>
</body>
</html>
